'number' + 3 + 3 // number33. Конкатенація.

null + 3 // 3. null - відсутність значення, або нульове значення.

5 && "qwerty" // qwerty. 5 - правдиве значення, тому повертає друге значення.

+'40' + +'2' + "hillel"; // 42hillel. Оператор + перетворює '40' та '2' на числа 40 та 2. 42 + "hillel" - конкатенація.

'10' - 5 === 6;// false. Строка '10' перетворюється на число 10. === - суворо дорівнює.

true + false // 1. true перетворюється на 1, а false на 0.

'4px' - 3 // Nan. '4px' неможливо перетворити на число, тому операцію виконати неможливо.

'4' - 3 // 1. '4' перетворюється на число 4.

'6' + 3 ** 0; // 61. 3 в нульовій степені 1. Оператор + перетворює число 1 в строку '1'.

12 / '6'// 2. Рядок '6' перетворюється на число 6.

'10' + (5 === 6);// '10false'. (5 === 6) - це строге порівняння, тобто дорівнює false. Рядок '10' + рядок 'false'.

null == ''// false. null не може дорівнювати порожньому рядку.

3 ** (9 / 3);// 27. Звичайне рівняння. Проводиться ділення та число 3 возводиться в степінь.

!!'false' == !!'true'//true. 'false' та 'true' звичайні строки. Заповнена строка = true. true = true.

0 || '0' && 1// 1. && виконується першим і повертає останнє істинне значення (1). || - повертає перше істинне. 0 - false, 1 - true.

(+null == false) < 1;// false. +null перетворюється на 0. 0=false (тобто це є true). true<1 - false. 

false && true || true// true. && повертає false. false || true - повертає true.

false && (false || true);// false. Спочатку дужки (true). false && true повертає false.

(+null == false) < 1 ** 5;// false. В дужках True. 1 в 5 степені = 1. True = 1. 1<1 - виходить false.